0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 10.11648;

boundaryField
{
    axis
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 10.11648;
    }
    outlet
    {
        type            calculated;
        value           uniform 10.11648;
    }
    top
    {
        type            calculated;
        value           uniform 10.11648;
    }
    wedge0
    {
        type            wedge;
    }
    wedge1
    {
        type            wedge;
    }
    ghv
    {
        type            calculated;
        value           nonuniform List<scalar> 
345
(
0
0
0
0
0
0
0
0
...
)
;
    }
}


// ************************************************************************* //
