0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 180.0431;

boundaryField
{
    wedge0
    {
        type            wedge;
    }
    ghv
    {
        type            zeroGradient;
    }
    outlet
    {
	type 		waveTransmissive;
	value		uniform 180.0431;
	field		p;
	gamma		1.4;
	lInf		1.9;
	fieldInf	180.0431;			
    }
    inlet
    {
        type            fixedValue;
        value           uniform 180.0431;
    }
    wedge1
    {
        type            wedge;
    }
    top
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
