system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluxScheme      Kurganov;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
	grad(p)		linearUpwind phi;
}

divSchemes
{
    default         none;
	div(phi,U)		Gauss vanLeerV grad(U);
	div(phi,h)		Gauss vanLeerV phi;	
	div(u,rho)		Gauss vanLeerV phi;
	div(u,p)		Gauss vanLeerV phi;	
}

laplacianSchemes
{
    default         none;
}

interpolationSchemes
{
    default         linear;
    reconstruct(rho) upwind phi;
    reconstruct(U)  upwind phi;
    reconstruct(T)  upwind phi;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //
